{
	"1.1": [
		"13 апреля 2024",
		"Задания репутации",
		"У заданий мира, которые являются заданиями репутации регионов, теперь отображается значок, репутации, что значительно упростит обнаружение уже пройденных вами на аккаунте заданий мира.",
		"Были произведены работы над \"Совместимосью версий\". Теперь при выходе новых регионов/областей, вы не сталкнётесь с проблемами и ничего не сломается.",
		"В навигационной панеле была добавлена ссылка \"Обновления\", нажав по которой, вы теперь можете открыть это окно."
	],
	"1.2": [
		"16 апреля 2024",
		"\"В процессе\"",
		"В процессе проверок некоторых квестов, мною были выявлены (и возможно будут находиться далее) идентичные заданий мира, но разными названиями, в следствии чего они были удалены. Чтобы у вас не возникло проблем, если эти квесты уже у вас были отмечены, мною был реализован функционал, который удалит из прогресса выполненных квестов эти дубликаты.",
		"Теперь каждое задание мира можно отметить как \"В процессе\", это нововведение, позволет вам более комфортно заниматься менеджментом ваших заданий. В довесок к этому добавлен переключатель \"Сначала в процессе\", включив, который задания, отмеченные как \"В процессе\" будут показываться первыми.",
		"Были внесены некоторые визуальные изменения: кнопка для отметки \"Выполнено\" в активном состоянии имеет зеленоватый оттенок, а кнопка для отметки \"В процессе\", аналогично жёлтый. Также была добавлена анимация \"Затухания\" квеста, когда вы отмечаете его как выполненный, если \"Скрыть выполненные\" активно. Добавлены микро-анимации.",
		"Исправлена ошибка из-за которой, если вы отметили квест и убрали отметку, после чего перезагрузили страницу ломался сайт."
	],
	"1.2.1": [
		"16 апреля 2024",
		"Багфиксы",
		"Исправлен визуальный баг, при котором если название квеста занимает более одной строки иконка репутации региона некорректно отображалась."
	],
	"1.2.2": ["24 апреля 2024", "Новые квесты", "Добавлены новые квесты версии 4.6."],
	"l1.3": [
		"28 апреля 2024",
		"Миграция",
		"Были проведены некоторые работы над изменением структуры данных проекта, была переписана структура хранения прогресса, и так как она отличается от того, как до этого выполнялся процесс хранения выполненных заданий, необходимо провести преобразования старого формата данных в новый, чтобы всё работало.",
		"Было это сделано не с бухты-барахты, а по разумным причинам, чтобы при добавлении/изменении/удалении какого-то контента на данном веб-ресурсе, и я, и вы не столкнулись с проблемами, всем приятного пользования сервисом!"
	],
	"l1.4": [
		"29 апреля 2024",
		"Поиск",
		"Добавлена функция поиска квестов и цепочек-квестов! Если по вашему запросу поиска была найдена именно квестовая цепочка, будут показаны все квесты из неё. Если в поисковой строке у вас есть какой-то текст, то до тех пор пока строка не пуста, переключатель \"Скрыть выполненные\" будет выключен и недоступен. Для удобства вы можете воспользоваться сочетанием клавиш Ctrl + F и строка поиска сразу станет активной.",
		"Был исправлен баг, при котором показывались названия подрегионов/квестовы цепочек при активном \"Скрывать выполненные\", если все квесты в нём были выполнены.",
		"Некоторые квесты были рассредоточены по новым квестовым цепочкам (в основном это инадзумские) для удобства. Так же были добавлены недостающие квесты в этих цепочках.",
		"Теперь, если заданием репутации является не конкретные квест, а вся квестовая цепочка, значёк опыта репутации находится рядом с названием квестовой цепочки, а не рядом с названием последнего квеста из цепочки.",
		"Так же теперь, если задание мира отмечено, как \"Выполнено\" кнопка \"В процессе\" скрывается (надо было назвать обновление \"Для нас — перфекционистов\")."
	]
}
